# Data verification and cleaning

In [30]:
import pandas as pd
import requests, io
from pathlib import Path

import os
import sys

In [33]:
data_location_movie = "~/Downloads/archive-2/Netflix_Dataset_Movie.csv"
data_location_rating = "~/Downloads/archive-2/Netflix_Dataset_Rating.csv"
df_movie = pd.read_csv(data_location_movie)
df_rating = pd.read_csv(data_location_rating)

In [34]:
df_movie.head()

   Movie_ID  Year                          Name
0         1  2003               Dinosaur Planet
1         2  2004    Isle of Man TT 2004 Review
2         3  1997                     Character
3         4  1994  Paula Abdul's Get Up & Dance
4         5  2004      The Rise and Fall of ECW

In [35]:
df_rating.head()

   User_ID  Rating  Movie_ID
0   712664       5         3
1  1331154       4         3
2  2632461       3         3
3    44937       5         3
4   656399       4         3

In [36]:
df_rating["Movie_ID"].value_counts()

1905    117075
2452    102721
4306    102376
571     101450
3860     98545
         ...
4161      1215
1375      1213
717       1212
2870      1092
4238      1042
Name: Movie_ID, Length: 1350, dtype: int64

In [38]:
df_movie.loc[df_movie["Movie_ID"] == 1905]

      Movie_ID  Year                                               Name
1904      1905  2003  Pirates of the Caribbean: The Curse of the Bla...